id: b7119648-7fd0-460f-bbe4-023325a5cf8e
name: Anomalous storage account creation
description: This alerts when creation of an anomalous number of storage accounts detected.
severity: Medium
requiredDataConnectors:  
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 1
tactics:
  - Impact
query:
// It is best to run this query on a lookback period which is at least 7 days.
let timeframe = 7d;
let OperationList = dynamic(
["Microsoft.Storage/storageAccounts/write"]);
AzureActivity
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue  in (OperationList)
| where ActivityStatus == "Succeeded" 
| make-series dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(7d), now(), 1d) by Caller
| extend AccountCustomEntity = Caller
| render timechart
