id: b7119648-7fd0-460f-bbe4-023325a5cf8e
name: Anomalous storage account creation
description: This alerts when creation of an anomalous number of storage accounts detected.
severity: Medium
requiredDataConnectors:  
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 1
tactics:
  - Impact
query:
// Recommended to run this query with a min. 7 days lookback period.
let timeframe = 14d;
let OperationList = dynamic(
["Microsoft.Storage/storageAccounts/write"]);
AzureActivity
| where TimeGenerated >= ago(timeframe)
| where OperationNameValue  in (OperationList)
| where ActivityStatus == "Succeeded" 
| make-series dcount(ResourceId) default=2 on EventSubmissionTimestamp in range(ago(14d), now(), 1d) by Caller
| extend AccountCustomEntity = Caller
| render timechart
