id: 5a0e1b79-b48c-4b94-a7c1-cd08826044d7
name: Too many storage accounts deleted
description: This alerts when too many storage accounts are deleted within a shorter period of time.
severity: Low
requiredDataConnectors:  
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 1
tactics:
  - Impact
query:
let starttime = 1d;
let alertOperationThreshold = 3;
// Storage account deleted
let OperationList = dynamic(
["Microsoft.Storage/storageAccounts/delete"]);
AzureActivity 
| where TimeGenerated > ago(starttime)
| where ResourceProvider == "Microsoft.Storage"
| where OperationNameValue in~ (OperationList)
| where ActivityStatus == "Succeeded"
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ActivityTimeStamp = makelist(TimeGenerated), ActivityStatus = makelist(ActivityStatus), 
OperationIds = makelist(OperationId), CorrelationIds = makelist(CorrelationId), Resources = makelist(Resource), ResourceGroups = makelist(ResourceGroup), ResourceIds = makelist(ResourceId), ActivityCountByCallerIPAddress = count()  
by CallerIpAddress, Caller, OperationName, Resource
| where ActivityCountByCallerIPAddress >= alertOperationThreshold
| extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress, HostCustomEntity = Resource

